; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v7)
             (pred_5 ?v9 ?v13)
             (pred_11 ?v4 ?v13)
             (pred_3 ?v8 ?v4 )
	     (pred_7 ?v4)
             (pred_12 ?v5)
             (pred_10 ?v9)
             (pred_2 ?v13)
             (pred_4 ?v4)
             (pred_8 ?v9)
             (pred_6 ?v4)
             (pred_9 ))



(:action op_3
:parameters (?v2 ?v12 ?v11 ?v3)
:precondition (and (pred_12 ?v2) (pred_12 ?v12) (pred_10 ?v11) (pred_2 ?v3)
          (pred_1 ?v2 ?v12) (pred_5 ?v11 ?v3)
                   (pred_11 ?v12 ?v3) (pred_7 ?v2) 
                   (pred_4 ?v12) (pred_8 ?v11))
:effect (and  (pred_6 ?v12) (not (pred_4 ?v12))))


(:action op_5
:parameters (?v2 ?v6)
:precondition (and (pred_12 ?v2) (pred_12 ?v6)
               (pred_7 ?v2) (pred_1 ?v2 ?v6) (pred_6 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v2))))

(:action op_4
:parameters (?v2 ?v11)
:precondition (and (pred_12 ?v2) (pred_10 ?v11) 
                  (pred_7 ?v2) (pred_3 ?v11 ?v2) (pred_9 ))
:effect (and (pred_8 ?v11)
   (not (pred_3 ?v11 ?v2)) (not (pred_9 ))))


(:action op_1
:parameters (?v2 ?v1 ?v10)
:precondition (and (pred_12 ?v2) (pred_10 ?v1) (pred_10 ?v10)
                  (pred_7 ?v2) (pred_8 ?v10) (pred_3 ?v1 ?v2))
:effect (and (pred_8 ?v1) (pred_3 ?v10 ?v2)
        (not (pred_8 ?v10)) (not (pred_3 ?v1 ?v2))))

(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_12 ?v2) (pred_10 ?v11) 
                  (pred_7 ?v2) (pred_8 ?v11))
:effect (and (pred_9 ) (pred_3 ?v11 ?v2) (not (pred_8 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_18 obj_12 obj_24 obj_13 obj_28 obj_30 obj_03 obj_29 obj_19 obj_23 obj_05 obj_11 obj_09 obj_16 obj_07 obj_26 obj_10 obj_14 obj_17 obj_25 obj_32 obj_08 obj_31 obj_01
    obj_06 obj_20 obj_27
    obj_02 obj_04 obj_21 obj_22
    )

    (:init
       (pred_9)

       (pred_12 obj_15)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_30)
       (pred_12 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_19)
       (pred_12 obj_23)
       (pred_12 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_25)
       (pred_12 obj_32)
       (pred_12 obj_08)
       (pred_12 obj_31)
       (pred_12 obj_01)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_27)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_21)
       (pred_10 obj_22)

       (pred_1 obj_15 obj_28)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_18 obj_30)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_12 obj_24)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_24 obj_29)
       (pred_1 obj_24 obj_13)
       (pred_1 obj_24 obj_12)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_24)
       (pred_1 obj_28 obj_23)
       (pred_1 obj_28 obj_30)
       (pred_1 obj_28 obj_15)
       (pred_1 obj_30 obj_05)
       (pred_1 obj_30 obj_03)
       (pred_1 obj_30 obj_18)
       (pred_1 obj_30 obj_28)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_03 obj_29)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_03 obj_30)
       (pred_1 obj_29 obj_09)
       (pred_1 obj_29 obj_19)
       (pred_1 obj_29 obj_24)
       (pred_1 obj_29 obj_03)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_19 obj_29)
       (pred_1 obj_23 obj_07)
       (pred_1 obj_23 obj_05)
       (pred_1 obj_23 obj_28)
       (pred_1 obj_05 obj_26)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_05 obj_30)
       (pred_1 obj_05 obj_23)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_16 obj_17)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_07 obj_25)
       (pred_1 obj_07 obj_26)
       (pred_1 obj_07 obj_23)
       (pred_1 obj_26 obj_32)
       (pred_1 obj_26 obj_10)
       (pred_1 obj_26 obj_05)
       (pred_1 obj_26 obj_07)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_10 obj_26)
       (pred_1 obj_14 obj_31)
       (pred_1 obj_14 obj_17)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_17 obj_16)
       (pred_1 obj_17 obj_14)
       (pred_1 obj_25 obj_32)
       (pred_1 obj_25 obj_07)
       (pred_1 obj_32 obj_08)
       (pred_1 obj_32 obj_26)
       (pred_1 obj_32 obj_25)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_32)
       (pred_1 obj_31 obj_01)
       (pred_1 obj_31 obj_14)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_01 obj_31)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_12)
       (pred_4 obj_28)
       (pred_11  obj_05 obj_06)
       (pred_11  obj_11 obj_20)
       (pred_11  obj_12 obj_27)
       (pred_11  obj_28 obj_27)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_24)
       (pred_6 obj_13)
       (pred_6 obj_30)
       (pred_6 obj_03)
       (pred_6 obj_29)
       (pred_6 obj_19)
       (pred_6 obj_23)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_07)
       (pred_6 obj_26)
       (pred_6 obj_10)
       (pred_6 obj_14)
       (pred_6 obj_17)
       (pred_6 obj_25)
       (pred_6 obj_32)
       (pred_6 obj_08)
       (pred_6 obj_31)
       (pred_6 obj_01)

       (pred_5  obj_02 obj_06)
       (pred_5  obj_04 obj_20)
       (pred_5  obj_21 obj_27)
       (pred_5  obj_22 obj_06)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_21 obj_01)
       (pred_3 obj_22 obj_07)
       (pred_7 obj_14)
    )

    (:goal (and
       (pred_3 obj_02 obj_25)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_21 obj_30)
       (pred_3 obj_22 obj_19)
    ))
(:constraints
  (always (not (pred_7 obj_10)))
)
)

; plan
1. (op_5 obj_14 obj_17)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_17)
   goals met: 0 of 4
2. (op_5 obj_17 obj_01)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_01)
   goals met: 0 of 4
3. (op_4 obj_01 obj_21)
   deleted: (pred_3 obj_21 obj_01) (pred_9)
   added: (pred_8 obj_21)
   goals met: 0 of 4
4. (op_5 obj_01 obj_17)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_17)
   goals met: 0 of 4
5. (op_5 obj_17 obj_16)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_16)
   goals met: 0 of 4
6. (op_5 obj_16 obj_19)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_19)
   goals met: 0 of 4
7. (op_5 obj_19 obj_13)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_13)
   goals met: 0 of 4
8. (op_1 obj_13 obj_04 obj_21)
   deleted: (pred_8 obj_21) (pred_3 obj_04 obj_13)
   added: (pred_8 obj_04) (pred_3 obj_21 obj_13)
   goals met: 0 of 4
9. (op_5 obj_13 obj_19)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_19)
   goals met: 0 of 4
10. (op_2 obj_19 obj_04)
   deleted: (pred_8 obj_04)
   added: (pred_9) (pred_3 obj_04 obj_19)
   goals met: 0 of 4
11. (op_5 obj_19 obj_13)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_13)
   goals met: 0 of 4
12. (op_4 obj_13 obj_21)
   deleted: (pred_3 obj_21 obj_13) (pred_9)
   added: (pred_8 obj_21)
   goals met: 0 of 4
13. (op_5 obj_13 obj_19)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_19)
   goals met: 0 of 4
14. (op_5 obj_19 obj_29)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_29)
   goals met: 0 of 4
15. (op_5 obj_29 obj_03)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_03)
   goals met: 0 of 4
16. (op_5 obj_03 obj_30)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_30)
   goals met: 0 of 4
17. (op_3 obj_30 obj_28 obj_21 obj_27)
   deleted: (pred_4 obj_28)
   added: (pred_6 obj_28)
   goals met: 0 of 4
18. (op_2 obj_30 obj_21)
   deleted: (pred_8 obj_21)
   added: (pred_9) (pred_3 obj_21 obj_30)
   goals met: 1 of 4
19. (op_5 obj_30 obj_03)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_03)
   goals met: 1 of 4
20. (op_5 obj_03 obj_29)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_29)
   goals met: 1 of 4
21. (op_5 obj_29 obj_09)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_09)
   goals met: 1 of 4
22. (op_5 obj_09 obj_14)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_14)
   goals met: 1 of 4
23. (op_4 obj_14 obj_02)
   deleted: (pred_3 obj_02 obj_14) (pred_9)
   added: (pred_8 obj_02)
   goals met: 1 of 4
24. (op_5 obj_14 obj_09)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_09)
   goals met: 1 of 4
25. (op_5 obj_09 obj_29)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_29)
   goals met: 1 of 4
26. (op_5 obj_29 obj_19)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_19)
   goals met: 1 of 4
27. (op_1 obj_19 obj_04 obj_02)
   deleted: (pred_8 obj_02) (pred_3 obj_04 obj_19)
   added: (pred_8 obj_04) (pred_3 obj_02 obj_19)
   goals met: 1 of 4
28. (op_5 obj_19 obj_29)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_29)
   goals met: 1 of 4
29. (op_5 obj_29 obj_03)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_03)
   goals met: 1 of 4
30. (op_5 obj_03 obj_30)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_30)
   goals met: 1 of 4
31. (op_2 obj_30 obj_04)
   deleted: (pred_8 obj_04)
   added: (pred_9) (pred_3 obj_04 obj_30)
   goals met: 2 of 4
32. (op_5 obj_30 obj_03)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_03)
   goals met: 2 of 4
33. (op_5 obj_03 obj_29)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_29)
   goals met: 2 of 4
34. (op_5 obj_29 obj_19)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_19)
   goals met: 2 of 4
35. (op_4 obj_19 obj_02)
   deleted: (pred_3 obj_02 obj_19) (pred_9)
   added: (pred_8 obj_02)
   goals met: 2 of 4
36. (op_5 obj_19 obj_29)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_29)
   goals met: 2 of 4
37. (op_5 obj_29 obj_03)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_03)
   goals met: 2 of 4
38. (op_5 obj_03 obj_30)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_30)
   goals met: 2 of 4
39. (op_5 obj_30 obj_28)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_28)
   goals met: 2 of 4
40. (op_5 obj_28 obj_23)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_23)
   goals met: 2 of 4
41. (op_5 obj_23 obj_07)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_07)
   goals met: 2 of 4
42. (op_5 obj_07 obj_25)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_25)
   goals met: 2 of 4
43. (op_2 obj_25 obj_02)
   deleted: (pred_8 obj_02)
   added: (pred_9) (pred_3 obj_02 obj_25)
   goals met: 3 of 4
44. (op_5 obj_25 obj_07)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_07)
   goals met: 3 of 4
45. (op_4 obj_07 obj_22)
   deleted: (pred_3 obj_22 obj_07) (pred_9)
   added: (pred_8 obj_22)
   goals met: 3 of 4
46. (op_5 obj_07 obj_23)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_23)
   goals met: 3 of 4
47. (op_5 obj_23 obj_28)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_28)
   goals met: 3 of 4
48. (op_5 obj_28 obj_30)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_30)
   goals met: 3 of 4
49. (op_5 obj_30 obj_03)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_03)
   goals met: 3 of 4
50. (op_5 obj_03 obj_29)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_29)
   goals met: 3 of 4
51. (op_5 obj_29 obj_19)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_19)
   goals met: 3 of 4
52. (op_2 obj_19 obj_22)
   deleted: (pred_8 obj_22)
   added: (pred_9) (pred_3 obj_22 obj_19)
   goals met: 4 of 4
